# TypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..TypeId Property
DirectShape Class See Also
---
Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId TypeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TypeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
```

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace